 {
  "Bio": {
    "Name": "Ethan C. Randolph",
    "Description": "Hello, I am Ethan Randolph. I am one of continuous improvement and motivated to make a change where I go. With my B.S. in Computer Science (that I obtained in 2022), I apply this methodology to the software industry, to ensure that both my workplace and my clients get the latest and the highest quality service that I can offer them. Whether I am quickly catching up to my peers or bringing them along with me, I continue to move forward. Here is how I got to this point: I started my humble beginnings at Victor Valley College, eventually transferring to California State University San Bernardino. Little did I know this is where I will continue to grow my career. During my senior year, I became an intern (or, a student assistant), to help a small startup of a lab called the Extended Reality for Learning Lab within CSUSB. The motivations of the coworkers I encountered there all wanted to help further education in experimental ways. This mainly involved utilizing Virtual Reality with the Unreal Engine to help develop custom projects to clients such as faculty that also shared our vision. Despite graduating with my degree, there was a lot I picked up quickly to adapt and help with one of their major projects. Through that project, I learned not only how to utilize the Unreal Engine, but also its high-level multiplayer api and working with the Meta Quest 2. This quick evolution would earn myself a spot to continue working at the company. With this opportunity, I did not hesitate to continue to take on projects, lead them, and continue to push for not only my own personal growth, but growth for the lab as well. I would continue to learn and utilize other technologies such as Node.JS, Python APIs, React.JS, Bash and Powershell Scripting, and more. My latest project with the lab involves evolving the development pipeline of my workplace, to meet closer to the ever evolving industry standard. By switching our development pipeline to a CI/CD model, along with tackling the unique cases present with working with the game engine in addition to more traditional software stacks, I continue to adapt myself to the current industry standards and continue to uplift the workplace I am stationed.",
    "Email": "ethan1randolph@gmail.com",
    "LinkedInLink": "https://www.linkedin.com/in/ethan-randolph-6a7489246/",
    "LinkedIn": "linkedin.com/in/ethan-randolph-6a7489246/",
    "GithubLink": "https://github.com/ethanr555",
    "Github": "github.com/ethanr555",
    "WebsiteLink": "https://ethanrandolph.com",
    "Website": "ethanrandolph.com"
  },
  "Projects": [
    {
      "Name": "Resume Generator",
      "Date": "2024",
      "CodeRepoName": "Github",
      "CodeRepoLink": "https://github.com/ethanr555/Resume-Generator",
      "Description": "The resume generator creates a resume using LaTeX and Python. Python takes in a json file formatted correctly, and then creates a LaTeX document based on the information. It organizes by tags to customize project contents in resume. It also measures line count to ensure it never suprasses it, useful for keeping the resume to 1 page, if one has many projects to show off. The LaTeX document then is processed into a pdf using TexLive. This is paired with my portfolio repo, which has Github Actions to automatically generate new resumes on portfolio update.",
      "DescriptionItems": 
      [
        "Developed a script to handle the task of creating multiple resumes for different job applications",
        "Created a base LaTeX format to simplify the process of creating the document",
        "Utilized Python to read a json file to customize the LaTeX file generation and generate the pdf from the LaTeX document",
        "Established Github Actions workflow to run the Python script to generate new resumes when the JSON file is updated"
      ],
      "Tools": [
        "Python",
        "LaTeX",
        "Github Actions",
        "AWS S3",
        "AWS Cloudfront",
        "AWS IAM"
      ],
      "Tags": [
        "Python",
        "LaTeX",
        "Github Actions",
        "Automation",
        "JSON"
      ]
    },
    {
      "Name": "Portfolio Website",
      "Date": "2022-2024",
      "CodeRepoName": "Github",
      "CodeRepoLink": "https://github.com/ethanr555/ethanr555.github.io",
      "ProjectSiteName": "ethanrandolph.com",
      "ProjectSiteLink": "https://ethanrandolph.com",
      "Description": "This website is designed not only for practice for HTML, CSS, and JavaScript, but it is also intended to demonstrate the projects I have worked on in my career. I have a mixture of career portfolio for projects I have worked on for my job, while my side projects are for my free time and allow me to flex my skills for stuff I am more passionate about. The JSON this website reads from also is the same one that the Resume Generator can use, which allows for multiple fronts to be updated at once.",
      "DescriptionItems": [
        "Revamped my original HTML-only website into a static React.js website",
        "Created the new website hosted on Github Pages, JSON Git repository to store portfolio data, and Amazon S3 and Cloudfront to store media files",
        "Utilized React.js and Typescript to construct the website and read the JSON file",
        "Now have a dynamic website that can be easily updated with just one file"
      ],
      "Tools": [
        "React.js",
        "Typescript",
        "Node.js",
        "AWS S3",
        "AWS Cloudfront",
        "Github Pages"
      ],
      "Videos": [
      ],
      "Images": [
      ],
      "Tags": [
        "React.js",
        "Typescript",
        "Javascript",
        "Node.js",
        "Github Pages",
        "JSON"
      ]
    },
    {
      "Name": "The Phoenix of Gaza XR",
      "Date": "2022-2024",
      "ProjectSiteName": "GazaXR",
      "ProjectSiteLink": "https://www.gazaxr.com/",
      "CompanyName": "GazaXR, LLC",
      "CompanyLink": "https://www.gazaxr.com/",
      "Description": " This is the Phoenix of Gaza, a project designed to reveal the inner life of the strip of Gaza that is not normally revealed to the outside world. The unreal version attempts to recreate and enhance the original Mozilla Hubs version by recreating the core features that were present, and then utilizing the Unreal Engine capabilities to further enhance this vision. The original version utilized Mozilla Hubs to hosted the imagery and videos of Gaza, but it was running into technical limitations. Utilizing PixelStreaming, this version was recreated in Unreal by using PixelStreaming to create the accessibilty that allows people who do not have the desktop or vr hardware to view the enhanced graphics of the Unreal Engine version. In addition epxeriences such as 360 photo spheres were enhanced with C++ (not possible with Mozilla Hubs) to allow the camera to be perfectly centered in the 360 sphere, and allowed the 360 sphere to be expanded client-side and a video to play that replaces the image thumbnail. The Unreal version recreates the multiplayer by taking advantage of Unreal Engine's built-in multiplayer systems, along with Vivox functionality to add excellent free voice chat for this small project. When I stopped working on it, there was much to be added, but I provided the core foundation and functionality that were the biggest concerns with the project. ",
      "DescriptionItems": [
        "Originally started as an xREAL Lab project, it was transferred to GazaXR, LLC, and needed to be improved for showcasing",
        "Was built with the Unreal Engine to take advantage of the media and AI framework",
        "Was shown at several events, incluing California State University San Bernardino, University of Redlands, University of Colorado, and soon to be shown at Princeton University, totaling hundreds of viewers to were able to witness the history of Gaza"
      ],
      "Team": "Lead Software Developer (myself), 2 3D Artists, 1 Photographer",
      "Tools": [
        "Unreal Engine 5.2",
        "C++",
        "Git",
        "Blender"
      ],
      "Videos": [
        "https://www.youtube-nocookie.com/embed/pmUPg3nQDVA?si=PwzkpQgmk8r9kRU5",
        "https://www.youtube-nocookie.com/embed/6gC5w_5JRkI?si=xlyd1XskvNexwYa9"
      ],
      "Images": [
        "https://d2m6vacaxnz5yc.cloudfront.net/phoenixofgaza/gaza1.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/phoenixofgaza/gaza2.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/phoenixofgaza/gaza3.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/phoenixofgaza/gaza4.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/phoenixofgaza/gaza5.png"

      ],
      "ImageThumbnails": [
        "https://d2m6vacaxnz5yc.cloudfront.net/phoenixofgaza/Thumbnails/gaza1thumb.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/phoenixofgaza/Thumbnails/gaza2thumb.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/phoenixofgaza/Thumbnails/gaza3thumb.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/phoenixofgaza/Thumbnails/gaza4thumb.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/phoenixofgaza/Thumbnails/gaza5thumb.png"
      ],
      "Thumbnail": "https://d2m6vacaxnz5yc.cloudfront.net/phoenixofgaza/Thumbnails/gaza3thumb.png",
      "Tags": [
        "UE",
        "C++",
        "Education",
        "GazaXR"
      ]
    },
    {
      "Name": "Cell Biology VR",
      "Date": "2022-2023",
      "CompanyName": "Extended Reality for Learning Lab at CSUSB",
      "CompanyLink": "https://www.csusb.edu/xreal-lab",
      "Description": " This was a project commmission by a Biology professor to reconstruct a cell that a student can explore. It stays simplified for the course material it was designed for and tests the students on their Biology knowledge to complete the assignment. Students are to go to each organelle and configure it using levers. They will be guided to some extent and given a few tries. After they complete that stage, a new stage occurs that causes an extracellular event. In this case, it was heat stress, and the student will have to reconfigure the cell to adapt to the new situation with new options present and new areas of the cell they can explore. I was the former project lead of this project. I met with the professor on a bi-weekly basis, and designed the systems to read lesson files that store the organelle positions and answers, in case this project was expanded upon. I learned Niagara systems to create many particle systems to add visual flair in the VR headset without taxing it too much from traditional means. I also created a lesson editor, which is an inhouse tool (accessible as a map in the Unreal Engine project files) that allows other developers to easily design different lessons for testing purposes or to create alterations of the existing elements per the client's requests. I also worked with our artist to provide art inspirations based on the professor'srequirements and to ensure that the technical design of the models allowed our programmers to easily adjust them for the spawn systems and visual display. ",
      "DescriptionItems": [
        "Programmed and managed the team for a VR Unreal Engine experience called \"Cell Biology VR\"",
        "Designed modular systems for spawning organelles, VR spatial inputs, and handling game state",
        "Created in-editor map that allows the developer to customize these json files to quickly setup up alternative learning objectives for setting correct/incorrect answers",
        "Tested in November 2024 with 10 students, and to be used as a learning activity for Spring 2025 Biology 3100 class at CSUSB"
      ],
      "Team": "Project manager/Software Developer (Me), 1 3D Artist, 1 Software Developer",
      "Tools": [
        "Unreal 5.1",
        "C++",
        "Git",
        "Blender"
      ],
      "Videos": [
        "https://www.youtube-nocookie.com/embed/iTBotKlVX5A?si=yOC1XImNrNxgflru",
        "https://www.youtube-nocookie.com/embed/835QfeTZBDo?si=XvPS_csxmq87CiCy"
      ],
      "Images": [
        "https://d2m6vacaxnz5yc.cloudfront.net/cellbiologyvr/cellbio3.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/cellbiologyvr/cellbio4.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/cellbiologyvr/cellbio5.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/cellbiologyvr/cellbio6.png"
      ],
      "ImageThumbnails": [
        "https://d2m6vacaxnz5yc.cloudfront.net/cellbiologyvr/Thumbnails/cellbio3thumb.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/cellbiologyvr/Thumbnails/cellbio4thumb.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/cellbiologyvr/Thumbnails/cellbio5thumb.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/cellbiologyvr/Thumbnails/cellbio6thumb.png"        
      ],
      "Thumbnail": "https://d2m6vacaxnz5yc.cloudfront.net/cellbiologyvr/Thumbnails/cellbio3thumb.png",
      "Tags": [
        "UE",
        "C++",
        "Game",
        "Education",
        "CSUSB"
      ]
    },
    {
      "Name": "Reconnections",
      "Date": "2021-2022",
      "CompanyName": "Extended Reality for Learning Lab at CSUSB",
      "CompanyLink": "https://www.csusb.edu/xreal-lab",
      "Description": "Reconnections is a 5-player multiplayer VR experience that tests the players on making eco-friendly, selfless choices or eco-harmful, selfish choices. Four players strap on the VR headsets to complete these tasks and reach the center of the island, where they will finally be able to see who else was altering the environment around them. The 5th player would be one of the people executing the study, watching all 4 players play as an invisible spectator on a standard Windows computer. I was involved for most of its development. I was responsible for altering/upgrading several core concept ideas including changing the motivation systems for the tasks to be based on real-life investments (time and challenge each option would present) rather than something like hunger or thirst like the client's original ideas were (there were no systems planned to punish/reward survival mechanics that hunger and thirst would affect). I was responsible for upgrading the code structure and systems utilizted in this project to be more scalable and modular to our client's and project needs as we continued developing. With my team, we adapted the entire code base of the project into Unreal's multiplayer framework, which would be the xREAL's first foray into multiplayer projects. I along with a collegue, were responsible for determining how adapt the code base by determining how the tasks will translate to other users, how they will load into the server and how the players will be able to interact with each other. I was responsible for initiating the push to include the fifth player for specating and server logging of events. Towards the latter half of the development cycle, I took on a more managerial position of ensuring the final parts of the projects fit into the codebase developed for the changed requirements of the project. ",
      "DescriptionItems": [
        "Created a 4-player multiplayer application to run study on player interactions with each other and the environment for client",
        "Established task system and mutiplayer foundations for a VR Unreal Engine project with xREAL Lab team",
        "Utilized Unreal Engine 5.0, Unreal Multiplayer framework, and C++ in a team of 10 to construct the game"
      ], 
      "Team": "1 Project Manager, 4-6 Software Developers (Me), 3 3D artists",
      "Tools": [
        "Unreal Engine 5.0",
        "C++",
        "Git",
        "Blender"
      ],
      "Videos": [
        "https://www.youtube-nocookie.com/embed/FJBjik6HSZ0?si=-lyrwJZjJN6_uMOo"
      ],
      "Images": [
        "https://d2m6vacaxnz5yc.cloudfront.net/reconnections/reconnect1.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/reconnections/reconnect2.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/reconnections/reconnect3.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/reconnections/reconnect4.png"
      ],
      "ImageThumbnails": [
        "https://d2m6vacaxnz5yc.cloudfront.net/reconnections/Thumbnails/reconnect1thumb.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/reconnections/Thumbnails/reconnect2thumb.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/reconnections/Thumbnails/reconnect3thumb.png",
        "https://d2m6vacaxnz5yc.cloudfront.net/reconnections/Thumbnails/reconnect4thumb.png"
      ],
      "Thumbnail": "https://d2m6vacaxnz5yc.cloudfront.net/reconnections/Thumbnails/reconnect2thumb.png",
      "Tags": [
        "UE",
        "C++",
        "Education",
        "CSUSB",
        "Game",
        "Multiplayer"
      ]
    }
  ],
  "Career": [
    {
      "Title": "Software Developer",
      "DescriptionItems": [
        "Developed the Phoenix of Gaza XR project, a VR game that contains rare 360 video footage and Gaza-inspired architecture",
        "Took the existing codebase created while under CSUSB and refactored redudant and vestigal code fragments",
        "Added new features to expand on the experience, such as a tour guide NPC, optimized map loading, etc.",
        "Updated project has been showcased at University of Redlands, University of Colorado, and soon to be showcased at Princeton University"
      ],
      "CompanyName": "GazaXR, LLC",
      "Date": "2024-Present",
      "Link": "https://www.gazaxr.com/"
    },
    {
      "Title": "Programmer/Analyst",
      "DescriptionItems": [
        "Developed software applications for faculty and staff under the Extended Reality for Learning Lab at CSUSB",
        "Analyzed key areas that the xREAL lab was lacking in its internal structure, while maintaining development for end-user projects",
        "Created an automation pipeline utilizing Github Actions to automatically build, test, and update projects",
        "Managed faculty requests and led development on several projects per their requests",
        "Improved development time for redundant projects, from 2 months to 2 weeks for simpler projects"
      ],
      "CompanyName": "California State University San Bernardino",
      "Date": "2022-Present",
      "Link": "https://www.csusb.edu/xreal-lab"
    },
    {
      "Title": "Student Programmer",
      "DescriptionItems": [
        "Learned Unreal Engine 5 and upgraded my C++ knowledge",
        "Developed a 4 player multiplayer project with a team of 10",
        "Designed core task system and multiplayer foundations for project"
      ],
      "CompanyName": "California State University San Bernardino",
      "Date": "2021-2022",
      "Link": "https://www.csusb.edu/xreal-lab"
    }
  ],
  "Education": [
    {     
      "UniversityName": "California State University San Bernardino",
      "UniversityLink": "https://www.csusb.edu/",
      "Degrees": [
        {
          "DegreeTitle": "Bachelor in Science",
          "DegreeMajor": "Computer Science",
          "GPA": 3.94,
          "Date": "2020-2022"
        }
      ]
    },
    {
      "UniversityName": "Victor Valley College",
      "UniversityLink": "https://www.vvc.edu/",
      "Degrees": [
        {
          "DegreeTitle": "Associate in Science",
          "DegreeMajor": "Computer Information Systems",
          "Date": "2015-2019"
        },
        {
          "DegreeTitle": "Associate in Science",
          "DegreeMajor": "Math and Science",
          "Date": "2015-2018"
        }
      ]      
    }
  ],
  "Skills": {
    "Languages": [
      "C++", 
      "Python", 
      "JavaScript", 
      "Typescript", 
      "C\\#",
      "LaTeX"
    ],
    "Frameworks": [
      "Unreal Engine 4", 
      "Unreal Engine 5", 
      "Node.js", 
      "React.js"
    ],
    "Tools": [
      "Git", 
      "Bash",
      "Powershell"
    ],
    "Technical": [
      "Project Management", 
      "Agile Methodologies", 
      "Prototyping and Testing", 
      "Documentation", 
      "UML Diagramming", 
      "Automation"
    ],
    "Platforms": [
      "Windows", 
      "Android (Meta Quest)", 
      "Linux (Debain-based)"
    ]
  }
}
